# -*- coding: utf-8 -*-

#+TITLE: Classification non supervisée - Clustering {{{NEWLINE}}}{{{NEWLINE}}} {{{HTMLFONTSIZE(Méthodes de partitionnement et algorithme k-Means, 10)}}}
#+AUTHOR: Roland Donat
#+EMAIL: roland.donat@univ-ubs.fr
#+DATE: {{{NEWLINE}}}BUT Science des Données

*** Résumé statistique d'une partition
{{{SUBTITLE(Exemple (1/2))}}}

#+BEGIN_SRC python :session c2_ex_stats_cls_kmeans :results silent :exports results 
import plotly.io as pio
import c2_ex_stats_cls_kmeans as ex                                                
#+END_SRC

#+REVEAL_HTML: <div class="column" style="float:left; width: 45%">

#+BEGIN_SRC python :session c2_ex_stats_cls_kmeans :results html :exports results 
format_dict = {var: '{:.2f}' for var
               in ex.data_sel_df.select_dtypes(float).columns}
props = [('font-size', '13px')]
data_styles = [dict(selector="th", props=props),
               dict(selector="td", props=props)]

ex.data_sel_df.style\
              .format(format_dict)\
              .set_table_styles(data_styles, overwrite=False)\
              .render()
#+END_SRC

#+RESULTS:
#+begin_export html
#+end_export

#+REVEAL_HTML: </div>

#+REVEAL_HTML: <div class="column" style="float:right; width: 50%">

- Effectifs dans chaque classe :
#+BEGIN_SRC python :session c2_ex_stats_cls_kmeans :results html :exports results 
cls_count_df = ex.cls_count.to_frame().transpose()
format_dict = {var: '{:.2f}' for var
               in cls_count_df.select_dtypes(float).columns}
props = [('font-size', '14px')]
data_styles = [dict(selector="th", props=props),
               dict(selector="td", props=props)]

cls_count_df.style\
            .format(format_dict)\
            .set_table_styles(data_styles, overwrite=False)\
            .render()
#+END_SRC


- Centres de gravité des classes :
#+BEGIN_SRC python :session c2_ex_stats_cls_kmeans :results html :exports results 
format_dict = {var: '{:.2f}' for var
               in ex.cls_mean.select_dtypes(float).columns}
props = [('font-size', '14px')]
data_styles = [dict(selector="th", props=props),
               dict(selector="td", props=props)]

ex.cls_mean.style\
           .format(format_dict)\
           .set_table_styles(data_styles, overwrite=False)\
           .render()
#+END_SRC


- Matrices de variances des classes :
#+BEGIN_SRC python :session c2_ex_stats_cls_kmeans :results html :exports results 
format_dict = {var: '{:.2f}' for var
               in ex.cls_cov.select_dtypes(float).columns}
props = [('font-size', '14px')]
data_styles = [dict(selector="th", props=props),
               dict(selector="td", props=props)]

ex.cls_cov.style\
           .format(format_dict)\
           .set_table_styles(data_styles, overwrite=False)\
           .render()
#+END_SRC

#+REVEAL_HTML: </div>

